In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
from scipy import stats
from sklearn.preprocessing import MinMaxScaler

C:\ProgramData\Anaconda3\lib\site-packages\scipy\__init__.py:146: UserWarning: A NumPy version >=1.16.5 and <1.23.0 is required for this version of SciPy (detected version 1.24.3
  warnings.warn(f"A NumPy version >={np_minversion} and <{np_maxversion}"

In [2]:
dict1 = {'Roll_No':[1,2,3,4,5], 'Name':['Aniket','Aaditi','Prasad','Aditya','Kartik'],'Maths_Marks':[40000,40100,40200,np.nan,50000],'Science_Marks':[78,25,np.nan,80,60],'English_Marks':[85,74,96,1000, np.nan]}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Roll_No        5 non-null      int64
 1   Name           5 non-null      object
 2   Maths_Marks    4 non-null      float64
 3   Science_Marks  4 non-null      float64
 4   English_Marks  4 non-null      float64
dtypes: float64(3), int64(1), object(1)
memory usage: 328.0+ bytes

In [5]:
df.isnull().sum()

Roll_No          0
Name             0
Maths_Marks      1
Science_Marks    1
English_Marks    1
dtype: int64

In [6]:
df.describe()

        Roll_No   Maths_Marks  Science_Marks  English_Marks
count  5.000000      4.000000       4.000000       4.000000
mean   3.000000  42575.000000      60.750000     313.750000
std    1.581139   4950.673355      25.473843     457.588152
min    1.000000  40000.000000      25.000000      74.000000
25%    2.000000  40075.000000      51.250000      82.250000
50%    3.000000  40150.000000      69.000000      90.500000
75%    4.000000  42650.000000      78.500000     322.000000
max    5.000000  50000.000000      80.000000    1000.000000

In [7]:
df1= df.copy()

In [8]:
df1.fillna(0, inplace= True)

In [9]:
df1

   Roll_No    Name  Maths_Marks  Science_Marks  English_Marks
0        1  Aniket      40000.0           78.0           85.0
1        2  Aaditi      40100.0           25.0           74.0
2        3  Prasad      40200.0            0.0           96.0
3        4  Aditya          0.0           80.0         1000.0
4        5  Kartik      50000.0           60.0            0.0

In [10]:
df2= df.copy()

In [11]:
df2['Science_Marks'] = df2['Science_Marks'].fillna(int(df2['Science_Marks'].mean()))

In [12]:
df2

   Roll_No    Name  Maths_Marks  Science_Marks  English_Marks
0        1  Aniket      40000.0           78.0           85.0
1        2  Aaditi      40100.0           25.0           74.0
2        3  Prasad      40200.0           60.0           96.0
3        4  Aditya          NaN           80.0         1000.0
4        5  Kartik      50000.0           60.0            NaN

In [13]:
df3= df.copy()

In [14]:
df3.dropna()

   Roll_No    Name  Maths_Marks  Science_Marks  English_Marks
0        1  Aniket      40000.0           78.0           85.0
1        2  Aaditi      40100.0           25.0           74.0

In [15]:
df4=df.copy()

In [16]:
df4

   Roll_No    Name  Maths_Marks  Science_Marks  English_Marks
0        1  Aniket      40000.0           78.0           85.0
1        2  Aaditi      40100.0           25.0           74.0
2        3  Prasad      40200.0            NaN           96.0
3        4  Aditya          NaN           80.0         1000.0
4        5  Kartik      50000.0           60.0            NaN

In [17]:
z= np.abs(stats.zscore(df1['Maths_Marks']))

In [18]:
z

0    0.340276
1    0.346005
2    0.351733
3    1.951145
4    0.913131
Name: Maths_Marks, dtype: float64

In [19]:
upper = np.where(z > 3)

In [20]:
upper

(array([], dtype=int64),)

In [21]:
scaler = MinMaxScaler()

In [22]:
df3 = df.drop(df[['Roll_No','Name']], axis =1)

In [23]:
df

   Roll_No    Name  Maths_Marks  Science_Marks  English_Marks
0        1  Aniket      40000.0           78.0           85.0
1        2  Aaditi      40100.0           25.0           74.0
2        3  Prasad      40200.0            NaN           96.0
3        4  Aditya          NaN           80.0         1000.0
4        5  Kartik      50000.0           60.0            NaN

In [24]:
df3

   Maths_Marks  Science_Marks  English_Marks
0      40000.0           78.0           85.0
1      40100.0           25.0           74.0
2      40200.0            NaN           96.0
3          NaN           80.0         1000.0
4      50000.0           60.0            NaN

In [26]:
scaler = MinMaxScaler()

scaled_col = scaler.fit_transform(df3)

In [28]:
scaled_col

array([[0.        , 0.96363636, 0.01187905],
       [0.01      , 0.        , 0.        ],
       [0.02      ,        nan, 0.0237581 ],
       [       nan, 1.        , 1.        ],
       [1.        , 0.63636364,        nan]])

In [29]:
scaled_df = pd.DataFrame(scaled_col, columns = ['Maths_Marks','Science_Marks','English_Marks'])

In [30]:
scaled_df

   Maths_Marks  Science_Marks  English_Marks
0         0.00       0.963636       0.011879
1         0.01       0.000000       0.000000
2         0.02            NaN       0.023758
3          NaN       1.000000       1.000000
4         1.00       0.636364            NaN